#pragma once

#ifdef __cplusplus
#define HLSL_ASSERT(expr) do{if(!(expr))__debugbreak();}while(0)

template<typename T, size_t LEN>
struct hlsl_vector_type;
template<typename T, size_t LEN, size_t ARRAY_SIZE>
struct hlsl_varray;
template<typename T, size_t LEN, size_t ARRAY_SIZE>
struct hlsl_varray_cb;
template<typename T, size_t LEN, size_t ROWS, size_t ARRAY_SIZE>
struct hlsl_marray;
template<typename T, size_t LEN, size_t ROWS, size_t ARRAY_SIZE>
struct hlsl_marray_cb;


template<typename T>
struct hlsl_vector_type<T, 1>
{
	union
	{
		T data[1];
		struct
		{
			T x;
		};
	};
	template<typename S>
	const hlsl_vector_type& operator = (const S& other)
	{
		static_assert(sizeof(S) == sizeof(*this));
		memcpy(&data[0], &other, sizeof(data));
		return *this;
	}
	template<typename S>
	S get() const
	{
		static_assert(sizeof(S) == sizeof(*this));
		return *(S*)&data[0];
	}
	T& operator[](int i)
	{
		static_assert(i < 1);
		return data[i];
	}
	const T& operator[](int i) const
	{
		static_assert(i < 4);
		return data[i];
	}

};
template<typename T>
struct hlsl_vector_type<T, 2>
{
	union
	{
		T data[2];
		struct
		{
			T x;
			T y;
		};
	};
	template<typename S>
	hlsl_vector_type& operator = (const S& other)
	{
		static_assert(sizeof(S) == sizeof(*this));
		memcpy(&data[0], &other, sizeof(data));
		return *this;
	}
	template<typename S>
	S get() const 
	{
		static_assert(sizeof(S) == sizeof(*this));
		return *(S*)&data[0];
	}
	T& operator[](int i)
	{
		static_assert(i < 2);
		return data[i];
	}
	const T& operator[](int i) const
	{
		static_assert(i < 2);
		return data[i];
	}

};

template<typename T>
struct hlsl_vector_type<T, 3>
{
	union
	{
		T data[3];
		struct
		{
			T x;
			T y;
			T z;
		};
	};
	template<typename S>
	hlsl_vector_type& operator = (const S& other)
	{
		static_assert(sizeof(S) == sizeof(*this));
		memcpy(&data[0], &other, sizeof(data));
		return *this;
	}
	template<typename S>
	S get() const
	{
		static_assert(sizeof(S) == sizeof(*this));
		return *(S*)&data[0];
	}
	T& operator[](int i)
	{
		static_assert(i < 3);
		return data[i];
	}
	const T& operator[](int i) const
	{
		static_assert(i < 3);
		return data[i];
	}
};

template<typename T>
struct hlsl_vector_type<T, 4>
{
	union
	{
		T data[4];
		struct
		{
			T x;
			T y;
			T z;
			T w;
		};
	};

	template<typename S>
	hlsl_vector_type& operator = (const S& other)
	{
		static_assert(sizeof(S) == sizeof(*this), "vector assign must match exactly");
		memcpy(&data[0], &other, sizeof(data));
		return *this;
	}
	template<typename S>
	S get() const 
	{
		static_assert(sizeof(S) == sizeof(*this));
		return *(S*)&data[0];
	}
	T& operator[](int i)
	{
		static_assert(i < 4);
		return data[i];
	}
	const T& operator[](int i) const
	{
		static_assert(i < 4);
		return data[i];
	}
};

template<typename T, size_t LEN, size_t ARRAY_SIZE>
struct hlsl_varray
{
	static_assert(sizeof(T) == 2 ||sizeof(T) == 4 ||sizeof(T) == 8, "only elements of 2, 4 or 8 bytes supported");
	static const int NUM_ELEMENTS = ARRAY_SIZE * LEN;

	T data[NUM_ELEMENTS];

	hlsl_vector_type<T, LEN>& operator[](int index)
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		T* ptr = &data[index*LEN];
		return *(hlsl_vector_type<T, LEN>*)ptr;
	}
	const hlsl_vector_type<T, LEN>& operator[](int index) const
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		T* ptr = &data[index*LEN];
		return *(hlsl_vector_type<T, LEN>*)ptr;
	}
	template<typename S>
	hlsl_varray& operator = (const S& other)
	{
		static_assert(sizeof(S) == sizeof(*this), "sizeof must match exactly. if you arrays of vectors with 1, 2 or 3 elements, you must assign one row a time");
		memcpy(&data[0], &other, sizeof(data));
		return *this;
	}

};


template<typename T, size_t LEN, size_t ARRAY_SIZE>
struct hlsl_varray_cb
{
	static_assert(sizeof(T) == 2 ||sizeof(T) == 4 ||sizeof(T) == 8, "only elements of 2, 4 or 8 bytes supported");
	typedef hlsl_vector_type<T, LEN> ELEMENT;

	static const size_t ELEMENT_SIZE = sizeof(ELEMENT);
	static const size_t ELEMENT_ARRAY_SIZE = 16 * ((ELEMENT_SIZE + 15) / 16); 
	static const int NUM_BYTES = (ARRAY_SIZE-1) * ELEMENT_ARRAY_SIZE + sizeof(T);

	//static_assert(sizeof(T) == sizeof(uint32), "uint16 and double not yet supported");
	//static const int NUM_ELEMENTS = (ARRAY_SIZE-1) * 4 + LEN;

	char data[NUM_BYTES];

	ELEMENT& operator[](int index)
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		ELEMENT* ptr =(ELEMENT*) &data[index * ELEMENT_ARRAY_SIZE];
		return *ptr;
	}
	const ELEMENT& operator[](int index) const
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		ELEMENT* ptr = (ELEMENT*)&data[index * ELEMENT_ARRAY_SIZE];
		return *ptr;
	}
	template<typename S>
	hlsl_varray_cb& operator = (const S& other)
	{
		static_assert(sizeof(S) == sizeof(*this), "sizeof must match exactly. if you arrays of vectors with 1, 2 or 3 elements, you must assign one row a time");
		memcpy(&data[0], &other, sizeof(data));
		return *this;
	}
};



//untested
template<typename T, size_t ARRAY_SIZE>
struct hlsl_any_array_cb
{
	static_assert(sizeof(T) == 2 ||sizeof(T) == 4 ||sizeof(T) == 8, "only elements of 2, 4 or 8 bytes supported");
	static const size_t ELEMENT_SIZE = sizeof(T);
	static const size_t ELEMENT_ARRAY_SIZE = 16 * ((ELEMENT_SIZE + 15) / 16); 
	static const int NUM_BYTES = (ARRAY_SIZE-1) * ELEMENT_ARRAY_SIZE + sizeof(T);

	char data[NUM_BYTES];

	ELEMENT& operator[](int index)
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		ELEMENT* ptr = (ELEMENT*)&data[index*ELEMENT_ARRAY_SIZE];
		return *ptr;
	}
	const ELEMENT& operator[](int index) const
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		ELEMENT* ptr = (ELEMENT*)&data[index*ELEMENT_ARRAY_SIZE];
		return *ptr;
	}
	template<typename S>
	hlsl_any_array_cb& operator = (const S& other)
	{
		static_assert(sizeof(S) == sizeof(*this), "sizeof must match exactly. ");
		memcpy(&data[0], &other, sizeof(data));
		return *this;
	}

};



template<typename T, size_t LEN, size_t ROWS, size_t ARRAY_SIZE>
struct hlsl_marray
{
	static_assert(sizeof(T) == 2 ||sizeof(T) == 4 ||sizeof(T) == 8, "only elements of 2, 4 or 8 bytes supported");
	static const int MAT_SIZE = LEN * ROWS;
	static const int NUM_ELEMENTS = MAT_SIZE * ARRAY_SIZE;
	typedef hlsl_varray<T, LEN, ROWS> ELEMENT;

	T data[NUM_ELEMENTS];

	ELEMENT& operator[](int index)
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		T* ptr = (ELEMENT*)&data[index * MAT_SIZE];
		return *(ELEMENT*)ptr;
	}
	const ELEMENT& operator[](int index) const
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		T* ptr = &data[index * MAT_SIZE];
		return *(ELEMENT*)ptr;
	}
};

template<typename T, size_t LEN, size_t ROWS, size_t ARRAY_SIZE>
struct hlsl_marray_cb
{
	static_assert(sizeof(T) == 2 ||sizeof(T) == 4 ||sizeof(T) == 8, "only elements of 2, 4 or 8 bytes supported");
	typedef hlsl_varray_cb<T, LEN, ROWS> ELEMENT;


	static const size_t ELEMENT_SIZE = ELEMENT::NUM_BYTES;
	static const size_t ELEMENT_ARRAY_SIZE = 16 * ((ELEMENT_SIZE + 15) / 16); 
	static const int NUM_BYTES = (ARRAY_SIZE-1) * ELEMENT_ARRAY_SIZE + sizeof(T);

	char data[NUM_ELEMENTS];

	ELEMENT& operator[](int index)
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		ELEMENT* ptr = (ELEMENT*)&data[index * ELEMENT_ARRAY_SIZE];
		return *ptr;
	}
	const ELEMENT& operator[](int index) const
	{
		HLSL_ASSERT(index < ARRAY_SIZE);
		ELEMENT* ptr = (ELEMENT*)&data[index * ELEMENT_ARRAY_SIZE];
		return *ptr;
	}
};




typedef int 		hlsl_bool;
typedef float 		hlsl_float;
typedef uint32 		hlsl_uint;
typedef int32  		hlsl_int;
typedef uint16  	hlsl_uint16_t;
typedef double  	hlsl_double;

typedef hlsl_vector_type<hlsl_float, 1> hlsl_float1;
typedef hlsl_vector_type<hlsl_float, 2> hlsl_float2;
